---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures
source: html/f85c5c93-90cd-5888-b8ac-c1ba6f7b2040.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures

Failures about SteelElement module

## Syntax (C#)
```csharp
public static class SteelElementsFailures
```